export const songList = [
  {
    "index": 0,
    "url": "https://music.163.com/song/media/outer/url?id=346089.mp3",
    "singer": "beyond乐队",
    "id": '347230',
    "name": "海阔天空",
    "pic": "http://p1.music.126.net/QHw-RuMwfQkmgtiyRpGs0Q==/102254581395219.jpg",
    "lyric": "[00:00.000] 作词 : 黄家驹\n[00:01.000] 作曲 : 黄家驹\n[00:02.000] 编曲 : Beyond/Kunihiko Ryo\n[00:03.000] 制作人 : Beyond/Kunihiko Ryo\n[00:04.000]\n[00:18.123]今天我 寒夜里看雪飘过\n[00:24.720]怀着冷却了的心窝漂远方\n[00:30.632]风雨里追赶 雾里分不清影踪\n[00:36.858]天空海阔你与我\n[00:39.922]可会变（谁没在变）\n[00:43.073]多少次 迎着冷眼与嘲笑\n[00:49.655]从没有放弃过心中的理想\n[00:55.537]一刹那恍惚 若有所失的感觉\n[01:01.742]不知不觉已变淡\n[01:04.863]心里爱（谁明白我）\n[01:08.371]原谅我这一生不羁放纵爱自由\n[01:15.410]也会怕有一天会跌倒\n[01:21.635]背弃了理想 谁人都可以\n[01:27.845]哪会怕有一天只你共我\n[01:33.698]\n[01:42.254]今天我 寒夜里看雪飘过\n[01:48.851]怀着冷却了的心窝漂远方\n[01:54.701]风雨里追赶 雾里分不清影踪\n[02:00.959]天空海阔你与我\n[02:04.052]可会变（谁没在变）\n[02:07.560]原谅我这一生不羁放纵爱自由\n[02:14.562]也会怕有一天会跌倒\n[02:20.822]背弃了理想 谁人都可以\n[02:27.073]哪会怕有一天只你共我\n[02:33.182]\n[03:07.939]仍然自由自我 永远高唱我歌\n[03:14.541]走遍千里\n[03:19.221]原谅我这一生不羁放纵爱自由\n[03:26.194]也会怕有一天会跌倒\n[03:32.460]背弃了理想 谁人都可以\n[03:38.709]哪会怕有一天只你共我\n[03:44.956]背弃了理想 谁人都可以\n[03:51.220]哪会怕有一天只你共我\n[03:56.672]原谅我这一生不羁放纵爱自由\n[04:03.671]也会怕有一天会跌倒\n[04:09.912]背弃了理想 谁人都可以\n[04:16.142]哪会怕有一天只你共我\n[04:22.325]\n[04:25.000]OP : Amuse Inc. & Fun House Inc.\n[04:28.000]SP : Amuse H.K. Ltd.\n"
  },
  {
    "index": 1,
    "url": "https://music.163.com/song/media/outer/url?id=1446233379.mp3",
    "id": '1446233379',
    "name": "处处吻",
    "singer": "杨千嬅",
    "pic": "https://p1.music.126.net/awQVkO1OmMWoxZL--dikJg==/109951164970741627.jpg?param=400y400",
    "lyric": "[00:09.655]你爱热吻却永不爱人\n[00:13.687]练习为乐但是怕熟人\n[00:17.770]你爱路过去索取见闻\n[00:21.770]陌路人变得必有份好感\n[00:26.003]你热爱别离\n[00:27.871]再合再离\n[00:29.104]似花瓣献技\n[00:30.737]叫花粉遍地 噢噢\n[00:34.054]你在播弄这穿线游戏\n[00:37.303]跟他结束\n[00:38.754]他与她再⼀起\n[00:40.837]你小心\n[00:41.820]⼀吻便颠倒众⽣\n[00:43.737]⼀吻便救⼀个人\n[00:45.787]给你拯救的体温\n[00:47.787]总会再捐给某人\n[00:49.837]⼀吻便偷⼀个心\n[00:51.837]⼀吻便杀⼀个人\n[00:53.893]⼀寸吻感⼀寸金\n[00:55.870]⼀脸崎岖的旅行\n[00:57.987]有半夜情人\n[00:59.754]延续吻别人\n[01:01.970]让你旧情人\n[01:03.704]又惠顾他人\n[01:06.087]每晚大概有上亿个人\n[01:10.087]在地球上落⼒的亲吻\n[01:14.186]你那习惯散播给众人\n[01:18.186]在地球上惠泽遍及世人\n[01:22.370]你热爱别离\n[01:24.320]再合再离\n[01:25.604]似花瓣献技\n[01:27.186]叫花粉遍地 噢噢\n[01:30.470]你在播弄这穿线游戏\n[01:33.738]跟他结束\n[01:35.171]她与他再⼀起\n[01:37.354]你小心 ⼀吻便颠倒众⽣\n[01:40.254]⼀吻便救⼀个人\n[01:42.450]给你拯救的体温\n[01:44.393]总会再捐给某人\n[01:46.426]⼀吻便偷⼀个心\n[01:48.441]⼀吻便刷⼀个人\n[01:50.410]⼀寸吻感⼀寸金\n[01:52.525]⼀脸崎岖的旅行\n[01:55.891]你为何未曾尽兴\n[01:57.726]这塑胶的爱情\n[01:59.649]跳蚤的旅程\n[02:01.983]延展偷天盖地\n[02:03.981]好本领\n[02:05.783]这吊诡的爱情\n[02:07.599]播种的旅程\n[02:09.664]别了她 她问他\n[02:11.561]他问她问他问她\n[02:13.282]延续愉快过程\n[02:15.377]你我他真高兴\n[02:17.627]下个她 她问他\n[02:19.593]他问她再请你结束这旅程\n[02:23.260]多得你这佳兴\n[02:25.744]你小心\n[02:26.677]⼀吻便颠倒众⽣\n[02:28.661]⼀吻便救⼀个人\n[02:30.676]给你拯救的体温\n[02:32.694]总会再捐给某人\n[02:34.728]⼀吻便偷⼀个心\n[02:36.661]⼀吻便刷⼀个人（杀）\n[02:38.744]⼀寸吻感⼀寸金\n[02:40.797]⼀脸崎岖的旅行\n[02:42.336]别了她 她问他\n[02:43.836]他问她问他问她\n[02:45.553]延续愉快过程\n[02:47.635]你我他真高兴\n[02:49.919]下个她 她问他\n[02:51.853]他问她问他问她\n[02:53.635]延续愉快过程\n[02:55.635]你我他真高兴\n[02:57.885]十个她 千个她\n[02:59.985]恩爱扩展的旅程\n[03:03.537]\n"
  },
  {
    "index": 2,
    "url": "https://music.163.com/song/media/outer/url?id=113757.mp3",
    "id": '113757',
    "name": "甜蜜蜜",
    "singer": "邓丽君",
    "pic": "https://p2.music.126.net/__K9OrLQxVbN-TzfQ7Lbyw==/18159534045160057.jpg?param=400y400",
    "lyric": "[00:25.000]甜蜜蜜你笑得甜蜜蜜\n[00:33.000]好像花儿开在春风里\n[00:37.000]开在春风里\n[00:43.000]在哪里在哪里见过你\n[00:50.000]你的笑容这样熟悉\n[00:55.000]我一时想不起\n[01:00.000]啊~~在梦里\n[01:07.000]梦里梦里见过你\n[01:14.000]甜蜜笑得多么甜蜜\n[01:21.000]是你~是你~梦见的就是你\n[01:28.000]在哪里在哪里见过你\n[01:35.000]你的笑容这样熟悉\n[01:39.000]我一时想不起\n[01:45.000]啊~~在梦里\n[01:52.000]\n[01:55.000] *************\n[01:58.000] M U S I C\n[02:01.000] *************\n[02:03.000]\n[02:06.000]在哪里在哪里见过你\n[02:13.000]你的笑容这样熟悉\n[02:18.000]我一时想不起\n[02:23.000]啊~~在梦里\n[02:30.000]梦里梦里见过你\n[02:37.000]甜蜜笑得多么甜蜜\n[02:43.000]是你~是你~梦见的就是你\n[02:51.000]在哪里在哪里见过你\n[02:58.000]你的笑容这样熟悉\n[03:02.000]我一时想不起\n[03:08.000]啊~~在梦里\n[03:15.000]啊~~在梦里~~\n[03:17.000]\n[03:20.000] ······ 在哪里见过你\n[03:22.000]\n"
  }
]

/**
 *  这里模拟请求获取歌曲及歌词结果
 */
export const getSongAndLyricList = (id) => {
  const promise = new Promise((resolve, reject) => {
    if (id !== '') {
      resolve(songList[id]);
    } else {
      reject('无法获取歌曲歌词信息');
    }
  })
  return promise
}